def dummy():
    print("خب من ديگه چي ميتونم بگم؟")
    print("تو شعورت رو باختي")
    print("تو تا آخر عمرت قراره توي دانشگاه سجاد مشغول کون دادن باشي")
    quit()

def sag():
    userInput = ""
    chooses = ["من کسخلم", "خايه مالي", "حذف درس", "خودکشي"]
    print(name+ " ، کسخلي؟ جدي ميپرسم ")
    print("کيري فکر کردي با اميد به خدا چي ميشه؟ تو کير خدا هم نيستي")
    print("خدا اصلا بهت فکر نميکنه. ببين با اين رويه قطعاً درس رو ميفتي")
    print("پيشنهاد ميکنم اگر کسخل نيستي مسيرت رو عوض کني")
    while userInput not in chooses:
        print("کدوم گزينه؟")
        print("من کسخلم؟ خايه مالي؟ حذف درس؟ خودکشي؟")
        userInput = input()
        if userInput == "خودکشي":
            suicide()
        elif userInput == "حذف درس":
            loop()
        elif userInput == "خايه مالي":
            death()
        elif userInput == "من کسخلم":
            dummy()
        else: print("درست تايپ کن کسخل")

def suicide():
    userInput = ""
    chooses = ["خايه مالي", "خودکشي"]
    print("تو ميري روي پشت بوم تا خودت رو بندازي پايين")
    print("خودت رو پرت ميکني اما در لحظه آخر منصرف ميشي و از لبه پنجره خودت رو ميگيري")
    print("در همين لحظه يه اتفاق عجيب مي افته")
    print("استاد مياد لبه پنجره و ميخواد نجاتت بده. اما يک شرط ميذاره")
    print("ميگه در صورتي نجاتت ميده که خايه ماليش رو بکني")
    while userInput not in chooses:
        print("خايه مالي؟ خودکشي؟")
        userInput = input()
        if userInput == "خايه مالي":
            print("تو ميپذيري و استاد نجاتت ميده")
            death()
        elif userInput == "خودکشي":
            print("تو واقعاً انسان شريفي بودي")
            print("هيچوقت تن به خايه مالي ندادي")
            print("اما به هر حال مث يه سگ مردي. اونم توي دانشگاه سجاد")
            print("هيچکس جنازه ت رو حتي از روي زمين جمع نميکنه. اما هميشه قهرمان آدم هايي که خايه مال نيستن ميموني")
            print("دمدم گرم")
            quit()
        else: print("درست تايپ نکردي")
        
def loop():
    userInput = ""
    chooses = ["خايه مالي","اميد به خدا", "خودکشي"]
    print(name+ "، تو تصميم گرفتي که درس رو حذف کني. ولي خب که چي")
    print("ترم بعد هم قراره با همين استاد برداري. اين چرخه هميشه ادامه داره")
    print("حالا وقتشه دوباره تصميم بگيري که ميخواي چيکار کني")
    while userInput not in chooses:
        print("خايه مالي؟ اميد به خدا؟ خودکشي؟ ")
        userInput = input()
        if userInput == "خايه مالي":
            death()
        elif userInput == "اميد به خدا":
            sag()
        elif userInput == "خودکشي":
            suicide()
        else: print("درست تايپ کن لطفاً")

def deathTwo():
    userInput =""
    print("حاجي تو واقعاً خايه مالي")
    print("واقعاً خيلي خايه مالي. اه اه اه")
    print("ببين، استاد با خايه مالي تو حال کرده و تو از اين به بعد ميشي خايه مال بي جيره و موجاب استاد. ت")
    print("حالا تو تا آخر عمرت بايد خايه مالي کني. گزينه ي ديگه اي برات نذاشتم چون ميدونستم دوباره خايه مالي رو انتخاب خواهي کرد")
    print("پايان")
    quit()

def death():
    userInput =""
    chooses = ["خايه مالي بيشتر","اميد به خدا","حذف درس"]
    print("اي خايه مال بدبخت")
    print("خايه مالي کردي و استاد خوشش اومد. اما حالا اون بيشتر ميخواد. اوضاع بي ريخته")
    print(name+ " ببين، دقت کن توي انتخابت. کدوم؟ ")
    while userInput not in chooses:
        print("خايه مالي بيشتر؟ حذف درس؟ اميد به خدا؟")
        userInput = input()
        if userInput == "خايه مالي بيشتر":
            deathTwo()
        elif userInput == "حذف درس":
            loop()
        elif userInput == "اميد به خدا":
            sag()
        else: print("درست تايپ کن خايه مال")
        
          

def introScene():
    userInput = ""
    chooses = ["حذف درس", "اميد به خدا", "خايه مالي"]
    print("تو تازه فهميدي که گير چه استاد کيري اي افتادي. چه ميکني؟")
    while userInput not in chooses:
        print("خايه مالي؟ حذف درس؟ اميد به خدا؟")
        userInput = input()
        if userInput == "خايه مالي":
            death()
        elif userInput == "حذف درس":
            loop()
        elif userInput == "اميد به خدا":
            sag()
        else: print("يکي از سه گزينه رو به درستي تايپ کن")
        

if __name__ == "__main__":
    while True:
        print("به دانشگاه سجاد خوش آمديد")
        print("آمدنتان به اين دانشگاه دست خودتان بود، اما رفتن تان دست خداست")
        print("آقاي کلانترنژاد به شما پروژه داده اما درس، نه!")
        print("حالا بايد راهي براي نجات خود از دست استادت پيدا کني")
        print("قبل از هر چيز، اسمت رو به من بگو")
        name = input()
        print(name+ " خدا به دادت برسه ")
        introScene()
